librbd_iscsi/yujiang/read/logs/fio-1m.fio.log
read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;read-1m;0;0;409128960;681689;665;600169;0;824;4.715786;3.580808;4111;1513087;24027.642026;33862.147641;1.000000%=6127;5.000000%=7569;10.000000%=8716;20.000000%=10551;30.000000%=12386;40.000000%=14221;50.000000%=16449;60.000000%=19267;70.000000%=23461;80.000000%=30015;90.000000%=41680;95.000000%=56360;99.000000%=141557;99.500000%=206569;99.900000%=450887;99.950000%=557842;99.990000%=1019215;0%=0;0%=0;0%=0;4116;1513094;24032.357813;33862.148386;2048;1169408;100.000000%;684170.512949;189815.146933;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.596206%;67.155197%;384920;0;980;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;16.88%;44.99%;31.68%;4.63%;1.48%;0.27%;0.05%;0.01%;0.01%;0.00%;sda;0;33015;0;14942;0;251888;251880;1.34%

read-1m: (groupid=0, jobs=1): err= 0: pid=3666690: Thu May 21 09:54:57 2020
   read: IOPS=665, BW=666MiB/s (698MB/s)(390GiB/600169msec)
    slat (nsec): min=836, max=824160, avg=4715.79, stdev=3580.81
    clat (msec): min=4, max=1513, avg=24.03, stdev=33.86
     lat (msec): min=4, max=1513, avg=24.03, stdev=33.86
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[    8], 10.00th=[    9], 20.00th=[   11],
     | 30.00th=[   13], 40.00th=[   15], 50.00th=[   17], 60.00th=[   20],
     | 70.00th=[   24], 80.00th=[   31], 90.00th=[   42], 95.00th=[   57],
     | 99.00th=[  142], 99.50th=[  207], 99.90th=[  451], 99.95th=[  558],
     | 99.99th=[ 1020]
   bw (  KiB/s): min= 2048, max=1169408, per=100.00%, avg=684170.51, stdev=189815.15, samples=1197
   iops        : min=    2, max= 1142, avg=668.07, stdev=185.35, samples=1197
  lat (msec)   : 10=16.88%, 20=44.99%, 50=31.68%, 100=4.63%, 250=1.48%
  lat (msec)   : 500=0.27%, 750=0.05%, 1000=0.01%, 2000=0.01%
  cpu          : usr=32.60%, sys=67.16%, ctx=384920, majf=0, minf=980
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=399540,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=666MiB/s (698MB/s), 666MiB/s-666MiB/s (698MB/s-698MB/s), io=390GiB (419GB), run=600169-600169msec

Disk stats (read/write):
  sda: ios=0/33015, merge=0/14942, ticks=0/251888, in_queue=251880, util=1.34%