librbd_iscsi/yujiang/read/logs/fio-256k.fio.log
read-256k: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;read-256k;0;0;149290240;248810;971;600015;0;907;3.760939;3.206103;1395;1243161;16457.501365;21264.687004;1.000000%=2277;5.000000%=2965;10.000000%=3555;20.000000%=4751;30.000000%=5996;40.000000%=7307;50.000000%=8716;60.000000%=11075;70.000000%=16711;80.000000%=26607;90.000000%=37486;95.000000%=47448;99.000000%=96993;99.500000%=124256;99.900000%=208666;99.950000%=246415;99.990000%=371195;0%=0;0%=0;0%=0;1398;1243163;16461.262304;21264.678595;2048;615424;100.000000%;249016.965833;77672.560737;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.538574%;67.026269%;566037;0;1784;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.19%;13.94%;42.17%;17.28%;21.97%;3.53%;0.87%;0.04%;0.01%;0.01%;0.01%;0.00%;sda;0;24385;0;12753;0;250776;250764;1.16%

read-256k: (groupid=0, jobs=1): err= 0: pid=3647881: Thu May 21 09:44:56 2020
   read: IOPS=971, BW=243MiB/s (255MB/s)(142GiB/600015msec)
    slat (nsec): min=567, max=907067, avg=3760.94, stdev=3206.10
    clat (usec): min=1395, max=1243.2k, avg=16457.50, stdev=21264.69
     lat (usec): min=1398, max=1243.2k, avg=16461.26, stdev=21264.68
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    8], 50.00th=[    9], 60.00th=[   12],
     | 70.00th=[   17], 80.00th=[   27], 90.00th=[   38], 95.00th=[   48],
     | 99.00th=[   97], 99.50th=[  125], 99.90th=[  209], 99.95th=[  247],
     | 99.99th=[  372]
   bw (  KiB/s): min= 2048, max=615424, per=100.00%, avg=249016.97, stdev=77672.56, samples=1200
   iops        : min=    8, max= 2404, avg=972.66, stdev=303.43, samples=1200
  lat (msec)   : 2=0.19%, 4=13.94%, 10=42.17%, 20=17.28%, 50=21.97%
  lat (msec)   : 100=3.53%, 250=0.87%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=32.54%, sys=67.03%, ctx=566037, majf=0, minf=1784
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=583165,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=243MiB/s (255MB/s), 243MiB/s-243MiB/s (255MB/s-255MB/s), io=142GiB (153GB), run=600015-600015msec

Disk stats (read/write):
  sda: ios=0/24385, merge=0/12753, ticks=0/250776, in_queue=250764, util=1.16%