librbd_iscsi/yujiang/read/logs/fio-4k.fio.log
read-4k: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;read-4k;0;0;12411740;20686;5171;600003;0;1387;2.899477;2.439269;614;802528;3090.212591;4339.655949;1.000000%=1564;5.000000%=1908;10.000000%=2023;20.000000%=2179;30.000000%=2277;40.000000%=2375;50.000000%=2473;60.000000%=2572;70.000000%=2703;80.000000%=2899;90.000000%=3260;95.000000%=4423;99.000000%=20578;99.500000%=39583;99.900000%=50069;99.950000%=53739;99.990000%=76021;0%=0;0%=0;0%=0;617;802529;3093.112068;4339.661778;112;29728;100.000000%;20703.304167;5624.715028;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.897390%;65.824947%;2744020;0;1562;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.06%;8.71%;85.62%;3.65%;0.93%;0.89%;0.14%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;sda;1;21848;0;12040;0;257768;257756;1.20%

read-4k: (groupid=0, jobs=1): err= 0: pid=3593775: Thu May 21 09:14:54 2020
   read: IOPS=5171, BW=20.2MiB/s (21.2MB/s)(11.8GiB/600003msec)
    slat (nsec): min=359, max=1387.1k, avg=2899.48, stdev=2439.27
    clat (usec): min=614, max=802528, avg=3090.21, stdev=4339.66
     lat (usec): min=617, max=802529, avg=3093.11, stdev=4339.66
    clat percentiles (usec):
     |  1.00th=[ 1565],  5.00th=[ 1909], 10.00th=[ 2024], 20.00th=[ 2180],
     | 30.00th=[ 2278], 40.00th=[ 2376], 50.00th=[ 2474], 60.00th=[ 2573],
     | 70.00th=[ 2704], 80.00th=[ 2900], 90.00th=[ 3261], 95.00th=[ 4424],
     | 99.00th=[20579], 99.50th=[39584], 99.90th=[50070], 99.95th=[53740],
     | 99.99th=[76022]
   bw (  KiB/s): min=  112, max=29728, per=100.00%, avg=20703.30, stdev=5624.72, samples=1200
   iops        : min=   28, max= 7432, avg=5175.78, stdev=1406.18, samples=1200
  lat (usec)   : 750=0.01%, 1000=0.06%
  lat (msec)   : 2=8.71%, 4=85.62%, 10=3.65%, 20=0.93%, 50=0.89%
  lat (msec)   : 100=0.14%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=32.90%, sys=65.82%, ctx=2744020, majf=0, minf=1562
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=3102935,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=20.2MiB/s (21.2MB/s), 20.2MiB/s-20.2MiB/s (21.2MB/s-21.2MB/s), io=11.8GiB (12.7GB), run=600003-600003msec

Disk stats (read/write):
  sda: ios=1/21848, merge=0/12040, ticks=0/257768, in_queue=257756, util=1.20%