librbd_iscsi/yujiang/read/logs/fio-4m.fio.log
read-4m: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;read-4m;0;0;710615040;1184265;289;600047;1;283;9.296172;5.528107;14631;6859261;55324.942849;80076.088277;1.000000%=19791;5.000000%=25034;10.000000%=29491;20.000000%=35389;30.000000%=40108;40.000000%=44302;50.000000%=48496;60.000000%=53215;70.000000%=58458;80.000000%=64749;90.000000%=76021;95.000000%=88604;99.000000%=139460;99.500000%=250609;99.900000%=1166016;99.950000%=1803550;99.990000%=3003121;0%=0;0%=0;0%=0;14638;6859271;55334.239021;80076.032412;8192;1433600;100.000000%;1189330.388796;259350.009501;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.143869%;67.731974%;146060;0;533;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.14%;52.33%;43.76%;2.27%;0.26%;0.04%;0.05%;0.12%;0.04%;sda;104;23750;0;12217;12;270696;270692;1.15%

read-4m: (groupid=0, jobs=1): err= 0: pid=3685103: Thu May 21 10:04:58 2020
   read: IOPS=289, BW=1157MiB/s (1213MB/s)(678GiB/600047msec)
    slat (nsec): min=1283, max=283633, avg=9296.17, stdev=5528.11
    clat (msec): min=14, max=6859, avg=55.32, stdev=80.08
     lat (msec): min=14, max=6859, avg=55.33, stdev=80.08
    clat percentiles (msec):
     |  1.00th=[   20],  5.00th=[   26], 10.00th=[   30], 20.00th=[   36],
     | 30.00th=[   41], 40.00th=[   45], 50.00th=[   49], 60.00th=[   54],
     | 70.00th=[   59], 80.00th=[   65], 90.00th=[   77], 95.00th=[   89],
     | 99.00th=[  140], 99.50th=[  251], 99.90th=[ 1167], 99.95th=[ 1804],
     | 99.99th=[ 3004]
   bw (  MiB/s): min=    8, max= 1400, per=100.00%, avg=1161.46, stdev=253.27, samples=1196
   iops        : min=    2, max=  350, avg=290.29, stdev=63.32, samples=1196
  lat (msec)   : 20=1.14%, 50=52.33%, 100=43.76%, 250=2.27%, 500=0.26%
  lat (msec)   : 750=0.04%, 1000=0.05%, 2000=0.12%, >=2000=0.04%
  cpu          : usr=32.14%, sys=67.73%, ctx=146060, majf=0, minf=533
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=173490,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1157MiB/s (1213MB/s), 1157MiB/s-1157MiB/s (1213MB/s-1213MB/s), io=678GiB (728GB), run=600047-600047msec

Disk stats (read/write):
  sda: ios=104/23750, merge=0/12217, ticks=12/270696, in_queue=270692, util=1.15%