librbd_iscsi/yujiang/read/logs/fio-64k.fio.log
read-64k: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;read-64k;0;0;67592960;112650;1760;600021;0;733;3.117992;2.359622;778;1389206;9086.057975;15095.683445;1.000000%=1630;5.000000%=2310;10.000000%=2932;20.000000%=3850;30.000000%=4620;40.000000%=5341;50.000000%=5865;60.000000%=6324;70.000000%=6782;80.000000%=7700;90.000000%=17170;95.000000%=31064;99.000000%=71827;99.500000%=102236;99.900000%=158334;99.950000%=183500;99.990000%=246415;0%=0;0%=0;0%=0;780;1389207;9089.175967;15095.724037;384;190336;100.000000%;112748.234167;31398.737529;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;32.631746%;66.789774%;995188;0;1994;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;2.77%;19.02%;63.62%;5.84%;6.95%;1.25%;0.52%;0.01%;0.01%;0.01%;0.01%;0.00%;sda;0;21863;0;12184;0;251280;251268;1.08%

read-64k: (groupid=0, jobs=1): err= 0: pid=3629484: Thu May 21 09:34:55 2020
   read: IOPS=1760, BW=110MiB/s (115MB/s)(64.5GiB/600021msec)
    slat (nsec): min=477, max=733122, avg=3117.99, stdev=2359.62
    clat (usec): min=778, max=1389.2k, avg=9086.06, stdev=15095.68
     lat (usec): min=780, max=1389.2k, avg=9089.18, stdev=15095.72
    clat percentiles (usec):
     |  1.00th=[  1631],  5.00th=[  2311], 10.00th=[  2933], 20.00th=[  3851],
     | 30.00th=[  4621], 40.00th=[  5342], 50.00th=[  5866], 60.00th=[  6325],
     | 70.00th=[  6783], 80.00th=[  7701], 90.00th=[ 17171], 95.00th=[ 31065],
     | 99.00th=[ 71828], 99.50th=[102237], 99.90th=[158335], 99.95th=[183501],
     | 99.99th=[246416]
   bw (  KiB/s): min=  384, max=190336, per=100.00%, avg=112748.23, stdev=31398.74, samples=1200
   iops        : min=    6, max= 2974, avg=1761.62, stdev=490.62, samples=1200
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=2.77%, 4=19.02%, 10=63.62%, 20=5.84%, 50=6.95%
  lat (msec)   : 100=1.25%, 250=0.52%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=32.63%, sys=66.79%, ctx=995188, majf=0, minf=1994
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1056140,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=64.5GiB (69.2GB), run=600021-600021msec

Disk stats (read/write):
  sda: ios=0/21863, merge=0/12184, ticks=0/251280, in_queue=251268, util=1.08%